import glob
from collections import Counter
import os
import unicodedata
from timeit import repeat
from UnicodeTokenizer import  BasicTokenizer as SanBasicTokenizer
from BertTokenization import BasicTokenizer as BertBasicTokenizer


def show(line, tokenizer):
    tokens = tokenizer.tokenize(line)
    print(' '.join(tokens))
    print(len(tokens))


if __name__ == "__main__":

    # ['[', ']', 'viiipays', '-', 'grand', '-', 'blanc', '-', 'eleve', '»', '(', '白', '高', '大', '夏', '國', ')']
    # a=tokenizer=Langer()
    a = tokenizer = SanBasicTokenizer(do_lower_case=True, never_split=set([
        "[UNK]", "[SEP]", "[PAD]", "[CLS]", "[MASK]"]))
    # b=tokenizer=BasicTokenizer()
    b = tokenizer = BertBasicTokenizer(do_lower_case=True)

    doc0 = """ '〇㎡[คุณจะจัดพิธีแต่งงานเมื่อไรคะัีิ์ื็ํึ]Ⅷpays-g[ran]d-blanc-élevé » (白高大夏國)'
            Ⅷ首先8.88设置 st。art_new_word=True 和 output=[açaí]，output 就是最终 no such name"
            的输出คุณจะจัดพิธีแต่งงานเมื่อไรคะ탑승 수속해야pneumonoultramicroscopicsilicovolcanoconiosis"
            하는데 카운터가 어디에 있어요ꆃꎭꆈꌠꊨꏦꏲꅉꆅꉚꅉꋍꂷꂶꌠلأحياء تمارين تتطلب من [MASK] [PAD] [CLS][SEP]
            est 𗴂𗹭𘜶𗴲𗂧, ou "phiow-bjij-lhjij-lhjij", ce que l'on peut traduire par « pays-grand-blanc-élevé » (白高大夏國).
        """
    for i, line in enumerate(doc0.split('\n')):
        if not line.strip():
            continue
        show(line, a)
        show(line, b)

    s = 'วรรณพงษ์เป็นนักศึกษาชั้นปีที่หนึ่ง เรียนสาขาวิทยาการคอมพิวเตอร์และสารสนเทศคณะวิทยาศาสตร์ประยุกต์และวิศวกรรมศาสตร์อยู่ที่มหาวิทยาลัยขอนแก่นวิทยาเขตหนองคายยืมคืนทรัพยากรห้องสมุดเอกสารสัมมนาคอมพิวเตอร์ปัญญาประดิษฐ์กับการพัฒนาเกมแมวกินปลาหิวววไหมหลักสูตรใหม่สดสดทนได้'
    show(s, a)
    t = 'ສົມເດັດພະເຈົ້າຢູ່ຫົວບໍຣົມໂກດຊົງທຳນຸບຳລຸງບ້ານເມືອງແລະພະສາດສະໜາຈົນກ່າວໄດ້ວ່າກຸງສີອະຍຸທະຢາໃນສະໄໝພະອົງນັ້ນເປັນຍຸກທີ່ບ້ານເມືອງດີ ມີຂຸນນາງຄົນສຳຄັນທີ່ເຕີບໂຕໃນເວລາຕໍ່ມາ ໃນລາຊະການຂອງພະອົງຫຼາຍຄົນ ເຊັ່ນ ສົມເດັດພະເຈົ້າກຸງທົນບຸລີ, ພະບາດສົມເດັດພະພຸດທະຍອດຟ້າຈຸລາໂລກມະຫາລາດ ເປັນຕົ້ນ ໃນທາງດ້ານວັນນະຄະດີກໍມີກະວີຄົນສຳຄັນ ເຊັ່ນ ເຈົ້າຟ້າທຳມາທິເບດໄຊຍະເຊດສຸລິຍະວົງ ກົມມະຂຸນເສນາພິທັກ ຫຼືເຈົ້າຟ້າກຸ້ງ ເຊິ່ງເປັນພະໂອລົດ ເປັນຕົ້ນ'
    show(t, a)

""" tokenize result (both basic)
Langer
BERT 

[]
[]
['首', '先', '8', '.', '88', '设', '置', 'st', '。', 'art', '_', 'new', '_', 'word', '=', 'true', '和', 'output', '=', '[', 'acai', ']', '，', 'output', '就', '是', '最', '终', 'no', 'such', 'name', '"']
['首', '先', '8', '.', '88', '设', '置', 'st', '。', 'art', '_', 'new', '_', 'word', '=', 'true', '和', 'output', '=', '[', 'acai', ']', '，', 'output', '就', '是', '最', '终', 'no', 'such', 'name', '"']
['的', '输', '出', 'ค', 'ณจะจ', 'ดพ', 'ธ', 'แต', 'งงานเม', 'อไรคะ', '탑', '승', '수', '속', '해', '야', 'pneumonoultramicroscopicsilicovolcanoconiosis', '"']
['的', '输', '出', 'คณจะจดพธแตงงานเมอไรคะ탑승', '수속해야pneumonoultramicroscopicsilicovolcanoconiosis', '"']
['하', '는', '데', '카', '운', '터', '가', '어', '디', '에', '있', '어', '요', 'ꆃ', 'ꎭ', 'ꆈ', 'ꌠ', 'ꊨ', 'ꏦ', 'ꏲ', 'ꅉ', 'ꆅ', 'ꉚ', 'ꅉ', 'ꋍ', 'ꂷ', 'ꂶ', 'ꌠ
', 'لاحياء', 'تمارين', 'تتطلب', 'من', '[MASK]', '[PAD]', '[', 'cls', ']', '[', 'sep', ']']
['하는데', '카운터가', '어디에', '있어요ꆃꎭꆈꌠꊨꏦꏲꅉꆅꉚꅉꋍꂷꂶꌠلاحياء', 'تمارين', 'تتطلب', 'من', '[MASK]', '[PAD]', '[', 'cls', ']', '[', 'sep', ']']
['est', ',', 'ou', '"', 'phiow', '-', 'bjij', '-', 'lhjij', '-', 'lhjij', '"', ',', 'ce', 'que', 'l', "'", 'on', 'peut', 'traduire', 'par', '«', 'pays', '-', 'grand', '-', 'blanc', '-', 'eleve', '»', '(', '白', '高', '大', '夏', '國', ')', '.']
['est', '𗴂𗹭𘜶𗴲𗂧', ',', 'ou', '"', 'phiow', '-', 'bjij', '-', 'lhjij', '-', 'lhjij', '"', ',', 'ce', 'que', 'l', "'", 'on', 'peut', 'traduire', 'par', '«', 'pays', '-', 'grand', '-', 'blanc', '-', 'eleve', '»', '(', '白', '高', '大', '夏', '國', ')', '.']
[]
[]

['วรรณพงษ์', 'เป็', 'นนั', 'กศึ', 'กษาชั้', 'นปี', 'ที่', 'หนึ่', 'ง', 'เรี', 'ยนสาขาวิ', 'ทยาการคอมพิ', 'วเตอร์', 'และสารสนเทศคณะวิ', 'ทยาศาสตร์', 'ประยุ', 'กต์', 'และวิ', 'ศวกรรมศาสตร
์', 'อยู่', 'ที่', 'มหาวิ', 'ทยาลั', 'ยขอนแก่', 'นวิ', 'ทยาเขตหนองคายยื', 'มคื', 'นทรั', 'พยากรห้', 'องสมุ', 'ดเอกสารสั', 'มมนาคอมพิ', 'วเตอร์', 'ปั', 'ญญาประดิ', 'ษฐ์', 'กั', 'บการพั',
 'ฒนาเกมแมวกิ', 'นปลาหิ', 'วววไหมหลั', 'กสู', 'ตรใหม่', 'สดสดทนได้']
['ສົ', 'ມເດັ', 'ດພະເຈົ້', 'າຢູ່', 'ຫົ', 'ວບໍ', 'ຣົ', 'ມໂກດຊົ', 'ງທຳນຸ', 'ບຳລຸ', 'ງບ້', 'ານເມື', 'ອງແລະພະສາດສະໜາຈົ', 'ນກ່', 'າວໄດ້', 'ວ່', 'າກຸ', 'ງສີ', 'ອະຍຸ', 'ທະຢາໃນສະໄໝພະອົ', 'ງນັ້',
 'ນເປັ', 'ນຍຸ', 'ກທີ່', 'ບ້', 'ານເມື', 'ອງດີ', 'ມີ', 'ຂຸ', 'ນນາງຄົ', 'ນສຳຄັ', 'ນທີ່', 'ເຕີ', 'ບໂຕໃນເວລາຕໍ່', 'ມາ', 'ໃນລາຊະການຂອງພະອົ', 'ງຫຼ', 'າຍຄົ', 'ນ', 'ເຊັ່', 'ນ', 'ສົ', 'ມເດັ', 'ດພ
ະເຈົ້', 'າກຸ', 'ງທົ', 'ນບຸ', 'ລີ', ',', 'ພະບາດສົ', 'ມເດັ', 'ດພະພຸ', 'ດທະຍອດຟ້', 'າຈຸ', 'ລາໂລກມະຫາລາດ', 'ເປັ', 'ນຕົ້', 'ນ', 'ໃນທາງດ້', 'ານວັ', 'ນນະຄະດີ', 'ກໍ', 'ມີ', 'ກະວີ', 'ຄົ', 'ນສຳຄັ
', 'ນ', 'ເຊັ່', 'ນ', 'ເຈົ້', 'າຟ້', 'າທຳມາທິ', 'ເບດໄຊຍະເຊດສຸ', 'ລິ', 'ຍະວົ', 'ງ', 'ກົ', 'ມມະຂຸ', 'ນເສນາພິ', 'ທັ', 'ກ', 'ຫຼື', 'ເຈົ້', 'າຟ້', 'າກຸ້', 'ງ', 'ເຊິ່', 'ງເປັ', 'ນພະໂອລົ', 'ດ',
 'ເປັ', 'ນຕົ້', 'ນ']

 ' 〇 ㎡ [ ค ณจะจ ดพ ธ แต งงานเม อไรคะ ] ⅷ pays - g [ ran ] d - blanc - eleve » ( 白 高 大 夏 國 ) '
34
' 〇㎡ [ คณจะจดพธแตงงานเมอไรคะ ] ⅷpays - g [ ran ] d - blanc - eleve » ( 白 高 大 夏 國 ) '
25
ⅷ 首 先 8 . 88 设 置 st 。 art _ new _ word = true 和 output = [ acai ] ， output 就 是 最 终    no such name "
36
ⅷ 首 先 8 . 88 设 置 st 。 art _ new _ word = true 和 output = [ acai ] ， output 就 是 最 终 no such name "
33
的 输 出 ค ณจะจ ดพ ธ แต งงานเม อไรคะ 탑 승 수 속 해 야 pneumonoultramicroscopicsilico volcanoconiosis "
19
的 输 出 คณจะจดพธแตงงานเมอไรคะ탑승 수속해야pneumonoultramicroscopicsilicovolcanoconiosis "
6
하 는 데 카 운 터 가 어 디 에 있 어 요 ꆃ ꎭ ꆈ ꌠ ꊨ ꏦ ꏲ ꅉ ꆅ ꉚ ꅉ ꋍ ꂷ ꂶ ꌠ لاحياء تمارين تتطلب من [MASK] [PAD] [ cls ] [ sep ]
40
하는데 카운터가 어디에 있어요ꆃꎭꆈꌠꊨꏦꏲꅉꆅꉚꅉꋍꂷꂶꌠلاحياء تمارين تتطلب من [MASK] [PAD] [ cls ] [ sep ]
15
est 𗴂 𗹭 𘜶 𗴲 𗂧 , ou " phiow - bjij - lhjij - lhjij " , ce que l ' on peut traduire par « pays - grand - blanc - eleve » ( 白 高 大 夏 國 ) .
43
est 𗴂𗹭𘜶𗴲𗂧 , ou " phiow - bjij - lhjij - lhjij " , ce que l ' on peut traduire par « pays - grand - blanc - eleve » ( 白 高 大 夏 國 ) .
39
วรรณพงษ เป นน กศ กษาช นป ท หน ง เร ยนสาขาว ทยาการคอมพ วเตอร และสารสนเทศคณะว ทยาศาสตร ประย กต และว ศวกรรมศาสตร อย ท มหาว ทยาล ยขอนแก นว ทยาเขตหนองคายย มค นทร พยากรห องสม ดเอกสารส มมนาคอมพ วเตอร ป ญญาประด ษฐ ก บการพ ฒนาเกมแมวก นปลาห วววไหมหล กส ตรใหม สดสดทนได
44
ສ ມເດ ດພະເຈ າຢ ຫ ວບ ຣ ມໂກດຊ ງທຳນ ບຳລ ງບ ານເມ ອງແລະພະສາດສະໜາຈ ນກ າວໄດ ວ າກ ງສ ອະຍ ທະຢາໃນສະໄໝພະອ ງນ ນເປ ນຍ ກທ ບ ານເມ ອງດ ມ ຂ ນນາງຄ ນສຳຄ ນທ ເຕ ບໂຕໃນເວລາຕ ມາ ໃນລາຊະການຂອງພະອ ງຫ າຍຄ ນ ເຊ ນ ສ ມເດ ດພະເຈ າກ ງທ ນບ ລ , ພະບາດສ ມເດ ດພະພ ດທະຍອດຟ າຈ ລາໂລກມະຫາລາດ ເປ ນຕ ນ ໃນທາງດ ານວ ນນະຄະດ ກ ມ ກະວ ຄ ນສຳຄ ນ ເຊ ນ ເຈ າຟ າທຳມາທ ເບດໄຊຍະເຊດສ ລ ຍະວ ງ ກ ມມະຂ ນເສນາພ ທ ກ ຫ ເຈ າຟ າກ ງ ເຊ ງເປ ນພະໂອລ ດ ເປ ນຕ ນ
93

"""
